{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the canvas size increase feature, listing affected files (SnakeCanvas.tsx, index.css), related components, and test ID REQ-20 with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the Snake game implementation including styling, game logic, canvas rendering, UI components, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for the application.",
  "frontend/index.html": "HTML entry point for the Impulse Snake application that mounts the React app to the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that renders the SnakeGamePage as the main application view.",
  "frontend/src/components/ControlLegend.tsx": "React component displaying game controls (W/A/S/D for movement, Space to start) with keyboard icons and styled UI elements.",
  "frontend/src/components/HudBar.tsx": "Heads-up display component showing player name and current score with trophy icon, featuring fixed minimum height for stable layout.",
  "frontend/src/game/SnakeCanvas.tsx": "Responsive canvas renderer with 800px default size that uses ResizeObserver to dynamically calculate cell size and render the Snake game with high-DPI graphics support.",
  "frontend/src/game/useImpulseSnake.ts": "Custom React hook implementing Snake game logic with impulse-style controls, fixed self-collision detection allowing movement into vacating tail cells, and single-instance animation loop with proper cleanup.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP backend actor creation with authentication support, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication with login/logout functionality, identity persistence, and configurable AuthClient options for ICP integration.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a vibrant green/amber theme for the Snake game, including CSS custom properties for light/dark modes and utility classes for game grid background and responsive playfield sizing.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the main App component.",
  "frontend/src/pages/SnakeGamePage.tsx": "Main game page component that manages game state, keyboard controls (WASD/arrows/space), player name input, and renders the start screen, HUD, canvas, and control legend with special handling to prevent game keys from interfering with text input fields.",
  "frontend/src/utils/isTextEditingElement.ts": "Utility function that determines if a DOM element is a text-editing context (input, textarea, or contentEditable) to prevent game keyboard shortcuts from interfering with text entry.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH color space, typography, container queries, animations, and plugins for the Snake game UI.",
  "project_state.json": "Project state tracking document listing implemented features, known issues (HUD positioning, player name input not accepting certain letters, missing final score on game-over), and architectural notes for the impulse-style Snake game."
}