{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Impulse Snake — fix Player Name typing vs global keyboard controls",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Ensure Player Name input accepts all characters while focused by preventing the global game key handler from intercepting keystrokes, while preserving game controls when not focused.",
      "acceptanceCriteria": [
        "On the start screen, click into the Player Name input and type \"XCVBNM\"; the input value shows exactly \"XCVBNM\".",
        "While the Player Name input is focused, typing any letters does not start/restart the game and does not move the snake (no game keyboard actions fire).",
        "When the Player Name input is NOT focused, existing game keyboard controls (W/A/S/D, Arrow keys, Space) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SnakeGamePage.tsx",
          "operation": "modify",
          "description": "Harden keyboard handling so the global window keydown logic never interferes with typing: (1) treat events as text-editing when either the event target or the active element is a text-editing element, and return early; (2) add an input-level keydown handler (capture phase) that stops propagation while the Player Name field is focused so keys like X/C/V/B/N/M cannot be consumed by the game handler; (3) keep existing behavior for Space/WASD/Arrow keys when the input is not focused. Ensure no files under frontend/src/components/ui are edited."
        },
        {
          "path": "frontend/src/utils/isTextEditingElement.ts",
          "operation": "modify",
          "description": "Extend/adjust the text-editing detection utility (if needed) to reliably identify editable contexts based on the received element (e.g., handle cases where the event target is within an editable container) so SnakeGamePage can accurately bypass game key handling during typing."
        }
      ]
    }
  ]
}